package com.example.myapplication5555;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import java.util.ArrayList;

public class AAA1 extends AppCompatActivity {
    ArrayList<Hotels> hotelsArrayList = new ArrayList<>();
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_aaa1);

            Hotels Hilton = new Hotels("منتجع هيلتون الكويت", "فندق 5 نجوم", R.drawable.hilton1, R.drawable.ic_baseline_location_on_24, "يقدم منتجع هيلتون الكويت إطلالات رائعة على البحر حيث يضم خمسة شواطئ رملية ناعمة، كما أنه قريب من العديد من أماكن الجذب المحلية. يقدم الفندق خدمة النقل بالحافلة المجانية من المنتجع إلى مدينة الكويت ومطار الكويت الدولي والعكس. قم بتجربة فريدة لتناول الطعام في خيمة خاصة وتذوق المأكولات العربية الأصيلة مع كوكتيل وشيشة في تراس وخيم بالم كورت الخاصة. ومن أجل تجربة استرخاء كاملة، دلل حواسك في السبا الذي يضم مسبح الأكوا- ميديك للعلاج المائي وساونا وغرفة بخار وغرفة ثلج وأدشاش استوائية مع مجموعة كبيرة من العلاجات وجلسات المساج المميزة .استمتع بالمرافق الترفيهية الأخرى بالمنتجع سواء للإقامة طويلة الأمد لرجال الأعمال والعائلات، أو الإقامات القصيرة أثناءعطلة نهاية الأسبوع","https://g.page/HiltonKuwaitResort?share");
            Hotels GrandHyat = new Hotels("Grand Hyatt", "فندق 5 نجوم", R.drawable.grandhytt, R.drawable.ic_baseline_location_on_24, "\n" +
                    "يطل فندق جراند حياة الكويت على أكثر التطورات الحديثة متعددة الأوجه في البلاد ، ويضم مركزًا تجاريًا فاخرًا ، وملاعب تنس داخلية وخارجية بالحجم الدولي ، وغراند أرينا متعددة الاستخدامات. يضم خيارات طهي فريدة تمتد من أوروبا إلى الشرق الأقصى ، ومنتجع صحي جذاب ، وأماكن اجتماعات كبيرة","https://g.page/grand-hyatt-kuwait?share");
            Hotels Astoria = new Hotels("والدورف أستوريا", "فندق 5 نجوم", R.drawable.astoria, R.drawable.ic_baseline_location_on_24, "يتميز Waldorf Astoria Kuwait بموقع جيد في حي فاروانيا في الكويت على بعد 4.2 كم من استاد جابر أحمد الدولي وعلى بعد 5 كم من جامعة الكويت وعلى بعد 8 كم من برج التحرير، ويضم مكان الإقامة مكتب استقبال يعمل على مدار الساعة، كما يرحب بالضيوف مع مطعم ومسبح في الهواء الطلق. يوفر مكان الإقامة خدمة الغرف وصالة مشتركة وخدمة تحويل العملات للضيوف.\n" +
                    "\n" +
                    "تحتوي غرف الضيوف على تكييف وتلفزيون بشاشة مسطحة مع قنوات فضائية وآلة لصنع القهوة وبيديه ومجفف شعر ومكتب. تحتوي جميع الغرف في الفندق على خزانة ملابس وحمام خاص.\n" +
                    "\n" +
                    "يمكن للضيوف في Waldorf Astoria Kuwait الاستمتاع بوجبة إفطار كونتيننتال.\n" +
                    "\n" +
                    "يوفر مكان الإقامة تراس.\n" +
                    "\n" +
                    "يقع متحف الكويت الوطني على بعد 8 كم من Waldorf Astoria Kuwait، في حين يقع سوق المباركية على بعد 9 كم، ويعتبر مطار الكويت الدولي المطار الأقرب للفندق حيث يقع على بعد 8 كم منه.","https://goo.gl/maps/pqkx9uywzGKB1nPn6");
            Hotels melenyom = new Hotels("فندق ملينيوم", "فندق 5 نجوم", R.drawable.unnamed, R.drawable.ic_baseline_location_on_24, "يتمتع فندق ومركز مؤتمرات ميلينيوم الكويت بموقع مثالي حيث يقع بجوار الحي المالي والتجاري في مدينة الكويت ويوفر إطلالات بانورامية على المدينة وخدمة الواي فاي المجانية في جميع المناطق ومسبحًا خارجيًا و3 أماكن لتناول الطعام، كما تبعد أبراج الكويت الشهيرة مسافة 15 دقيقة بالسيارة.\n" +
                    "\n" +
                    "يوفر هذا الفندق المصنف 5 نجوم 295 غرفة ضيوف وجناح مفروشة بشكل جيد وتتميز بديكور أنيق ووسائل راحة فاخرة، كما تشتمل الميزات الأساسية على تلفزيون بشاشة مسطحة ومنطقة جلوس ومكتب عمل، فيما تتوفر مرافق صنع الشاي/القهوة وميني بار.\n" +
                    "\n" +
                    "يمكن للضيوف الاستمتاع بمجموعة من المأكولات العالمية والمحلية في مطعم Lamar العالمي أو الاسترخاء في بار المسبح أثناء تناول وجبة غداء خفيفة، ولمحبي وقت الشاي، يقدم مقهى Library مجموعة كبيرة من الشاي والوجبات الخفيفة أثناء الاستمتاع بقراءة جيدة أو محادثة حميمة.\n" +
                    "\n" +
                    "يشمل النادي الصحي مركزًا للياقة البدنية مع معدات جيم ™مبتكرة، كما يتوفر مسبح مدفأ خارجي وغرف للمساج، فضلاً عن ساونا وغرف البخار، فيما يضم فندق ومركز مؤتمرات ميلينيوم الكويت مناطق وظيفية بمساحة تزيد عن 6000 متر مربع موزعة على 21 قاعة للمناسبات ومجهزة بالتكنولوجيا السمعية والبصرية الأكثر حدائة.\n" +
                    "\n" +
                    "يتم توفير خدمة نقل المطار مجانًا، كما تتوفر مواقف خاصة ومجانية للسيارات في الموقع.","https://g.page/MillenniumHotelKuwait?share");
            Hotels syphone = new Hotels("Symphony Style", "فندق 5 نجوم", R.drawable.symphone, R.drawable.ic_baseline_location_on_24, "يقع Symphony Style Hotel Kuwait في قلب السالمية وعلى بعد 23 كم من مطار الكويت الدولي وبالقرب من منطقة الأعمال ومراكز التسوق الرئيسية والمركز العلمي والمتاحف والعديد من المعالم السياحية الأخرى في مدينة الكويت.\n" +
                    "\n" +
                    "يحتوي Symphony Style Hotel Kuwait على 175 غرفة وجناح، حيث توفر جميعها إطلالة مواجهة لبحر الخليج العربي، كما تتميز الغرف بتلفزيون إل سي دي من ماركة Bang & Olufsen وميني بار وآلات إسبريسو في الغرفة وتم تجهيزها ببياضات أسرّة رائعة، فيما توفر كل غرفة وسائل راحة للضيوف وحمّام ذو تصميمات رائعة مع أردية حمّام ومناشف.\n" +
                    "\n" +
                    "يتميز Symphony Style Hotel Kuwait أيضاً بتجربة لتناول الطعام والتي تشمل مطعم Cucina الذي يوفر إمكانية تناول الطعام على مدار اليوم، ويقدم بوفيهات إفطار وغداء وعشاء، كما يقدم مقهى Choco مجموعة واسعة من الأطباق والقهوة والحلويات.","https://goo.gl/maps/gKRatFKG9orMrp9t7");
            Hotels garden = new Hotels("هيلتون جاردن إن", "فندق 4 نجوم", R.drawable.gardan, R.drawable.ic_baseline_location_on_24, "يقع \"هيلتون غاردن إن كويت\" في الكويت في ذا أفينيوز الذي يُعد أكبر مول للتسوق في الكويت، ويبعد مسافة 10.8 كم من مطار الكويت الدولي، وهو مكان إقامة يوفر مطعماً مع تراس وخدمة الغرف ومواقف خاصة للسيارات مجاناً ومسابح خارجية، كما تشمل المرافق المتوفرة في مكان الإقامة هذا غرفاً للاجتماعات ومركزاً للأعمال وخدمة الكونسيرج، بالإضافة إلى خدمة الواي فاي مجاناً في جميع أنحائه، فيما يوفر هذا الفندق مكتب استقبال يعمل على مدار الساعة.\n" +
                    "\n" +
                    "تضم جميع الغرف في هذا الفندق مكتباً وتلفزيوناً بشاشة مسطحة وثلاجة صغيرة وحمّاماً خاصاً.\n" +
                    "\n" +
                    "يوفر مكان الإقامة بوفيه إفطار.\n" +
                    "\n" +
                    "يوفر \"هيلتون غاردن إن كويت\" خدمة غسيل ذاتية للملابس، بالإضافة إلى مرافق الأعمال.\n" +
                    "\n" +
                    "يقع هذا الفندق على بُعد 14.4 كم من أبراج الكويت ومسجد الكويت الكبير.","https://g.page/HiltonGardenInnKuwait?share");
            Hotels betna = new Hotels("Gulf Grand", "فندق 4 نجوم", R.drawable.betna, R.drawable.ic_baseline_location_on_24, "Gulf Grand Hotel يوفر الإقامة الرخيصة على بعد 27 كم من Magic Planet Kuwait ويتميز بـالصراف الآلي وصالون التجميل والحلاق. الملكية تتألف من 40 غرفة.\n" +
                    "\n" +
                    "يقع قرب Ber Alwaldain المكان يقع بجانب شاطيء المهبولة. متحف شهداء القرين يبعد 10 كم من هذه الاقامة ة.\n" +
                    "\n" +
                    "تتضمن مرافق الغرفة تلفزيون الكابل مع أفلام حسب الطلب والثلاجة والصالون في Gulf Grand Hotel. كل غرفة تطل على البحر. الملكية توفر المايكرويف والغلاية الكهربائية ومحمصة الخبز في غرف الضيوف ايضاً.\n" +
                    "\n" +
                    "يمكن الوصول إلى \u202ACafe Bazza Abu Halifa\u202C الذي يقدم وجبات متنوعة خلال 10 دقائق سيرا.مطار الكويت الدولي واقع على بعد 20 كم.تتضمن وسائل العلاج معالجات تغليف الجسم والبيديكير والمانيكير. دروس فتنس ودروس يوغا و لعبة رشق السهام والبولينغ وركوب الدراجات تساعد المسافرين بالحفاظ على رشاقتهم.","https://goo.gl/maps/bvwMvDBsvy1aAQSK6");
            Hotels masged = new Hotels("ماجيك سويت المهبولة", "فندق 3 نجوم", R.drawable.mmmma, R.drawable.ic_baseline_location_on_24, "يوفر Magic Suite Al Mahboula خدمة الواي فاي المجانية، ويضم مكان إقامة في الكويت، على بعد 20 كم من أرض المعارض الدولية الكويت، يقع المركز العلمي على بعد 25 كم من مكان الإقامة ويضم مكتب استقبال يعمل على مدار 24 ساعة.\n" +
                    "\n" +
                    "يقع 360 مول على بعد 26 كم من الفندق، في حين يقع وسط مدينة السالمية على بعد 26 كم. ويقع مطار الكويت الدولي على بعد 29 كم من مكان الإقامة.","https://goo.gl/maps/LwvbPw1c7dQBnS8x5");



            hotelsArrayList.add(Hilton);
            hotelsArrayList.add(GrandHyat);
            hotelsArrayList.add(Astoria);
            hotelsArrayList.add(melenyom);
            hotelsArrayList.add(syphone);
            hotelsArrayList.add(garden);
            hotelsArrayList.add(betna);
            hotelsArrayList.add(masged);

        ListView listView = findViewById(R.id.list);

        HotelaAdaptar Adabtar = new HotelaAdaptar(this,0,hotelsArrayList);

        listView.setAdapter(Adabtar);


        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Hotels currentHotel = hotelsArrayList.get(i);

                Intent intent = new Intent(AAA1.this,AAA2.class);
                intent.putExtra("Hotels",currentHotel);
                startActivity(intent);

            }
        });

    }
}