package com.example.myapplication5555;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import java.util.ArrayList;

public class CCC1 extends AppCompatActivity {
    ArrayList<Plase> PlaseList = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_ccc1);

        Plase kuwaitTower = new Plase("أبراج الكويت ",R.drawable.ktowersss,"https://goo.gl/maps/jjDEe3B6R88kUw7H8","أبراج الكويت هي ثلاثة أبراج على ساحل الخليج العربي في مدينة الكويت في منطقة تسمى رأس عجوزة، تقع على شاطئ الخليج العربي مقابل قصر دسمان في منطقة شرق بمدينة الكويت.\n" +
                "\n" +
                "صممت الأبراج من قبل مكتب ليندستروم الهندسي في السويد ونفذت من قبل شركة انيرجوبروجيكت اليوغوسلافية، بنيت في عام 1975 وافتتحت رسميًا في 1 مارس من عام 1979، ويصل ارتفاع البرج الرئيسي إلى 187 مترا. تعتبر من أبرز معالم الكويت وتمثل رمز من رموز النهضة المعاصرة ودليل تقدمها وارتقائها.\n" +
                "\n" +
                "في عام 1980 فازت الأبراج بجائزة آغا خان للعمارة الإسلامية، وقد شرحت اللجنة التي اختارت الأبراج ذلك بأن بناء هذه الأبراج هي محاولة دمج التقنيات الحديثة والقيم الجمالية والاحتياجات الوظيفية والخدمات الاجتماعية في منشأة واحدة.\n" +
                "\n" +
                "وفي يوم 31 ديسمبر 2001 تم إطفاء الأنوار في أبراج الكويت وذلك لتوديع عام 2001 الذي كانت فيه الكويت عاصمة للثقافة العربية.\n" +
                "\n" +
                "في 1 أغسطس 2007 أعلن الرياضي علي العيدان بأنه يسعى إلى تحطيم رقمه القياسي السابق في ركوب الأدراج وذلك بركوبه أدراج الأبراج تخليدا لذكرى شهداء الكويت في 2 أغسطس، وقد كان في عام 2006 قد صعد الأدراج التي تعادل 45 طابقا بارتفاع 175 متر في أربعة دقائق وثلاثين ثانية.\n" +
                "\n" +
                "في يوم 14 نوفمبر 2007 أعلنت رابطة السكر الكويتية بأنها ستحتفل بمناسبة يوم السكر العالمي بإضاءة أبراج الكويت بمشاركة 100 معلم عالمي، سيتم إضاءة الأبراج باللون الأزرق.\n" +
                "\n" +
                "في يوم 5 مارس 2009 انطلق رالي الكويت 2009 من أمام الأبراج");
        Plase Grand = new Plase("المسجد الكبير",R.drawable.grand,"https://goo.gl/maps/4doXHLFWnkoqa9DW7","مسجد الدولة الكبير هو مسجد يقع في مدينة الكويت قرب شاطئ الخليج العربي أفتتح عام 1986م بناء على توجيهات من الشيخ جابر الأحمد الصباح. بدأ العمل في بنائه عام 1979 واكتمل عام 1986 وبلغت كلفة إنجازه 14 مليون دينار كويتي وساهم في بنائه خمسون مهندسا وأربعمائة وخمسون عاملا. صمم المسجد المهندس المعماري محمد صالح مكية واختار تصميمه على الطراز الأندلسي الفاخر وتبلغ مساحة المسجد 45 ألف مترا مربعا، منها 25 ألف مترا مربعا مبنية، و20 ألف مترا مربعا مكشوفة تشكل حدائق وممرات المسجد الخارجية.\n" +
                "\n" +
                "يعد أكبر مسجد في دولة الكويت حيث أنه يصلي في المسجد في ساحات المسجد في ليلة 27 من رمضان حوالي 170,000 شخص. يتبع المسجد من الناحية الإدارية إلى قطاع الشؤون الثقافية في وزارة الأوقاف والشؤون الإسلامية، ويقع مبنى الإدارة في الجهة الجنوبية من المسجد. تعمل إدارة المسجد الحالية تحت شعار «مؤسسة إسلامية رائدة ومعلم إسلامي متميز» وبشكل منسجم مع رؤية المسجد ورسالته وغاياته الإستراتيجية. ويؤم المصلين في صلاة القيام الشيخ مشاري بن راشد العفاسي والشيخ فهد الكندري والشيخ صلاح الهاشم ويؤم المصلين في الأيام العادية الإمام والخطيب في المسجد الكبير الشيخ د.وليد العلي\n" +
                "\n" +
                "ويتكون المسجد الكبير من أجزاء عديدة تؤدي دورها بتناسق وإيقاع، فهي من جهة مجموعة لا تكاد توجد في مسجد آخر إلا في النادر من مساجد العالم، كما أنها من جهة أخرى تمثل عدة مدارس معمارية قديمة أصيلة وحديثة مبدعة، مع تميزها ببعض اللمسات المحلية ويتميز المسجد الكبير بوجود ثلاثة بيوت للصلاة: البيت الرئيسي، والمصلى اليومي، ومصلى النساء.\n" +
                "\n");
        Plase Avenus = new Plase("الأفينيوز ",R.drawable.aven,"https://goo.gl/maps/NrYg5hA7CJAHmKAm6","يعتبر مجمع الأڤنيوز مول (بالإنجليزية: The Avenues)\u200F أكبر مجمع ومركز تسوق تجاري في الكويت. يقع المجمع في منطقة الري الصناعية على امتداد طريق الدائري الخامس من جهة الجنوب وطريق الغزالي السريع من الشرق. في عام 2013 فاز بالجائزة الذهبية لـ «أفضل مركز تسوق 2013» في منطقة الشرق الأوسط وشمال أفريقيا.\n" +
                "\n" +
                "افتتح الأڤنيوز في أبريل 2007 تحت رعاية وحضور حضرة صاحب السمو أمير البلاد الشيخ صباح الأحمد الجابر الصباح. حيث تزد تجربة التسوق في الأڤنيوز بإضافة بعد جديد لأكبر تجمع للتسوق والترفيه والذي يعد أيضًا أحد أكبر المجمعات التجارية على مستوى المنطقة. حيث يحتضن الأڤنيوز سلسلة من أشهر العلامات التجارية العالمية والمحلية الموزعة على سبعة مناطق وهي منطقة فرست أڤنيو، سكند أڤنيو، غراند أڤنيو، برستيج، سوكو، المول والسوق.\n" +
                "\n" +
                "كما يتميز الأڤنيوز بتصميم عمراني خلاب يجمع عدد من المدارس العمرانية المتنوعة، ويمنح كل منطقة هوية خاصة والمستوحاة من أعرق المدن في العالم مما يجعل من تجربة التسوق في الأڤنيوز تجربة فريدة لكل متسوق وزائر. ويتميز الأڤنيوز بمزيج من العلامات التجارية المتنوعة من أشهر دور الأزياء العالمية والمطاعم والترفيه تمتد على مساحة تأجيرية تبلغ حوالي 270 الف متر مربع، ويتضمن أكثر من 800 محل تجاري، ومواقف سيارات تسع لحوالي 10000 سيارة.");
        Plase center = new Plase("المركز العلمي",R.drawable.cinter,"https://www.tsck.org.kw/ar/","يحتوي المركز العلمي على ثلاثة أقسام هي (الأكواريوم) وقاعة الاستكشافات وقاعة سينما (آيماكس). وهو الأول في الشرق الأوسط الذي يحتوي على هذه المرافق الثلاث. بالإضافة إلى متحف يمثل صناعة السفن التي سبق استخدامها في التجارة ونقل البضائع الأكواريوم يتيح القسم فرصة التجول في ثلاث بيئات رئيسية في الجزيرة العربية هي البحر والساحل والصحراء، وجميعها تضّم أنواعاً من الحيوانات والنباتات والأحياء البحرية المحلية. يضم الأكواريوم مجموعة من الأحواض يُتوجها الحوض الرئيسي لأسماك الخليج ذو سعة 1.5 مليون لتر ماء ويضم أحياء المياه العميقة، مثل القروش واللخم. ويقوم غواصوا المركز العلمي من شباب وشابات الكويت بإطعام القروش واللخم والأسماك أمام زوار الأكواريوم حسب جداول العروض الحية المعدة مسبقاً وآخر وهو حوض. IMAX يحتوي دار العرض (IMAX) شاشتها العملاقة التي يبلغ ارتفاعها 15 متراً وعرضها 20 متراً تم تزويدها بأحدث ما توصلت إليه تقنيات العرض السينمائي وتعرض أفلاماً تعليمية ووثائقية تناسب جميع الأعمار بتقنية العرض ثلاثي الأبعاد يدعمها نظام صوتي غامر بقوة 8000 واط. تستخدم (IMAX) أكبر قياس أفلام عرفته صناعة السينما ويعادل 10 أضعاف القياس العادي (35) ملم. قاعة الاستكشاف تحتوي هذه القاعة على: آبار النفط : يستطيع الأطفال حفر بئر نفط، وقيادة شاحنة مسح زلزالى وحتى إنه يمكنك أن تنقل النفط وتحمله على ناقلات عبر أنابيب وصمامات بأسلوب ممتع، وتتعرف على منافذ التوزيع المختلفة وإن رغبت بالعمل في مصنع لتحويل النفط إلى إطارات ومواد بلاستيكي. معروضات النفط: يمكن التعرف إذا كان هناك تشابه بين البوصلة والمحرك الكهربائي؟ كيف يسري التيار الكهربائي من البطارية إلى المصباح؟ كنك أنويم تتحدى صديقك في سباق كهربائي. عرض الدمى المتحركة: هنا يمكنك مشاهدة الدمى التي تتحرك. سفينة النجوم: ويطلق عليها قبة النجوم ويبلغ طول قبة النجوم ثلاثة أمتار، أما قطرها فيبلغ ستة أمتار. كما تسع القبة لثلاثين شخص من مختلف الأعمار. تقدم العروض في المناسبات والاحتفالات الموسمية. الأحافير أحافير ضخمة يصل عمرها إلى مئات ملايين السنين يضم المركز مجموعة نادرة وقيّمة جدا من الأحافير، وهي عبارة عن كائنات بحرية متحجّرة عثر عليها في المغرب بالقرب من الحدود الجزائرية، تتكون المجموعة من قسمين الأول وهو أحافير ضخمة وهي أقدم ويصل عمر بعضها إلى 500 مليون سنة وأكثر، وأما القسم الآخر فهي صغيره ويصل عمر بعضها إلى 400 مليون سنة");
        Plase mobarkia  = new Plase("سوق المباركية ",R.drawable.mobarkia,"https://goo.gl/maps/x9rU2Ns9TtyPBTLP8","سوق المباركية، هو سوق كويتي يقع في منطقة القبلة وهو سوق تراثي وسمي نسبة إلى الشيخ مبارك الصباح، ويتميز السوق بتصميمه الذي يشبه الأسواق القديمة. وهو من المعالم التراثية لدولة الكويت هذا السوق يزخر بأنواع وفيرة من اللحوم والاسماك والمواد الغذائية والاستهلاكية والحلويات الشعبية والتمور والعسل ومحلات العطارة والملبوسات الرجالية والنسائية، إضافة إلى مجموعة من محلات أكسسوارات والسلع التراثية والتحف والخزفيات والتذكارات وكلها بأسعار مناسبة كما يوجد به سوق لبيع وشراء المصوغات الذهبية والمجوهرات. كما يوجد داخل السوق العديد من المقاهي الشعبية والاستراحات والمطاعم صممت على طراز القديم وتقدم مأكولات ومشروبات شعبية.");
        Plase hayawan = new Plase("حديقة الحيوان",R.drawable.anemals,"https://goo.gl/maps/9wVv5eJfYXrgCwpAA","حديقة حيوان دولة الكويت هي معلم من معالم الكويت السياحية والترفيهية والثقافية والبيئية حيث تحتوي علي عدد 1606 من الحيوانات والطيور النادرة مقسمة إلي خمس وحدات كل وحدة تحتوي علي ما لا يقل عن 12 نوع , مجموع الأنواع 188 نوع ومتأقلمة مع البيئة التي تم توفيرها لها في الأقفاص .\n" +
                "\n" +
                "\n" +
                "والحديقة لها دور في زيادة المعرفة و تثقيف وتعليم الأطفال كيفية المحافظة علي الحيوانات و النباتات , وتحتوي الحديقة علي أربعة أقسام وهي كالتالي :\n");
        Plase grenislan  = new Plase("الجزيرة الخضراء ",R.drawable.greenisland,"https://goo.gl/maps/368fBTfowziYUAA28","جزيرة الخضراء هي جزيرة اصطناعية أسست من قِبَل شركة المشروعات السياحية قرب أبراج الكويت على مساحة بحرية بلغت 785 ألف مترًا مربعًا، وهي الجزيرة الصناعية الأولى في الخليج. وقطر يبلغ حوالي نصف كيلو متر، ومحيط يبلغ 3140 مترًا، ويربطها بالبر ممر طوله 134 مترًاوهي تضم برجًا سياحيًا يبلغ ارتفاعه 35 مترًا، وقلعة ترويجية للأطفال مجهزة بخنادق وشلالات مائية صغيرة، وملف حلزوني على شكل تل دائري صغير يخترقه طريق لولبي، بالإضافة إلى مطاعم ومراكز خدمات أخرى على شكل مدرج روماني.");
        Plase shahed = new Plase("حديقة الشهيد ",R.drawable.shahed,"https://goo.gl/maps/G88zdnUgdPjrbb5w9","حديقة الشهيد (بالإنجليزية: Al Shaheed Park)\u200F هي أكبر حديقة حضرية في الكويت. تم افتتاح المرحلة الأولى منها في 4 مارس 2015، بينما افتتحت المرحلة الثانية في 12 أبريل 2017، وتقع الحديقة في أطراف مدينة الكويت، بمساحة إجمالية تقد بـ 220 الف متر مربع، وتضم نصب الدستور وساحة السلام ومتحف الموطن ومتحف الذكرى الذي يصف أهم معارك الكويت (مثل معركة الرقة ومعركة الصريف ومعركة الجهراء). وهو أحد أهم المشاريع التي نفذها الديوان الأميري بتميز واقتدار لإبراز صورة الكويت الحضارية. تعتبر الحديقة الشهيد أقدم الحدائق التقليدية في الكويت. وكان يطلق على حديقة الشهيد اسم حديقة «الحزام الأخضر»، حيث تم هدمها وإعادة تصميمها من جديد برؤية كويتية تضاهي أجمل الحدائق العالمية.");


        PlaseList.add(kuwaitTower);
       PlaseList.add(Grand);
       PlaseList.add(Avenus);
       PlaseList.add(center);
       PlaseList.add(mobarkia);
       PlaseList.add(hayawan);
       PlaseList.add(grenislan);
       PlaseList.add(shahed);

        ListView listView3 = findViewById(R.id.list3);

       PLaceAdaptar Adabtar3 = new PLaceAdaptar(this,0,PlaseList);

        listView3.setAdapter(Adabtar3);

        listView3.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Plase currenPlase = PlaseList.get(i);
                Intent intent = new Intent(CCC1.this,CCC2.class);
                intent.putExtra("PLS",currenPlase);
                startActivity(intent);
            }
        });



    }
}